List<Map<String, dynamic>> anniversaryList = [
  {
    'title': '与某某相识纪念日',
    'description': '庆祝与某某相识的特殊日子，纪念我们的缘分',
  },
  {
    'title': '宠物领养纪念日',
    'description': '庆祝你与宠物的相遇，回顾领养的美好时光',
  },
  {
    'title': '接回纪念日',
    'description': '记住那个特别的日子，接回宠物或家人的日子',
  },
  {
    'title': '第一次旅行纪念日',
    'description': '纪念与亲朋好友的第一次旅行，回忆那些美好的时光',
  },
  {
    'title': '第一次约会纪念日',
    'description': '回顾第一次约会的甜蜜时刻，庆祝彼此的相知相守',
  },
  {
    'title': '买房纪念日',
    'description': '庆祝购买第一套房子的特别日子',
  },
  {
    'title': '毕业纪念日',
    'description': '回顾毕业时光，纪念人生中的一个重要转折点',
  },
  {
    'title': '第一次工作纪念日',
    'description': '纪念自己踏入职场的第一天，记录职业生涯的重要起点',
  },
  {
    'title': '家庭聚会纪念日',
    'description': '纪念每年与家人一起聚会的特别日子',
  },
  {
    'title': '第一次独立生活纪念日',
    'description': '庆祝自己开始独立生活的日子，回顾从依赖到独立的成长',
  },
  {
    'title': '第一次获得奖项纪念日',
    'description': '纪念人生中第一次获得重要奖项或成就的时刻',
  },
  {
    'title': '职场晋升纪念日',
    'description': '庆祝在职场上获得晋升、升职的特别日子',
  },
  {
    'title': '创业纪念日',
    'description': '纪念自己创业成功或启动企业的那一天',
  },
  {
    'title': '第一次成为父母纪念日',
    'description': '庆祝成为父母的特殊日子，回顾孩子出生的时刻',
  },
  {
    'title': '重要考试合格纪念日',
    'description': '纪念通过某个重要考试的日子，例如考研、考证等',
  },
  {
    'title': '跨国搬迁纪念日',
    'description': '庆祝从一个国家搬迁到另一个国家，开始新的生活',
  },
  {
    'title': '大病康复纪念日',
    'description': '纪念战胜大病、重病后的康复日子，感谢生命的坚韧',
  },
  {
    'title': '第一次自驾旅行纪念日',
    'description': '庆祝第一次与朋友或家人一起自驾旅行的经历',
  },
  {
    'title': '大额消费纪念日',
    'description': '纪念某次大额消费事件，如买车、装修等',
  },
  {
    'title': '毕业后重聚纪念日',
    'description': '和毕业同学、老朋友多年后的重聚，回忆旧时光',
  },
  {
    'title': '手工项目完成纪念日',
    'description': '庆祝完成一个特别的手工项目，如DIY家居、艺术创作等',
  },
  {
    'title': '养生开始纪念日',
    'description': '纪念开始注重身心健康、健身或养生的那一天',
  },
  {
    'title': '创作完成纪念日',
    'description': '庆祝自己完成某个创作，如书籍、音乐作品、艺术作品等',
  },
];
